Задача 1 =======================================================================================

Ответ: grep -v '^#' /etc/passwd | cut -d: -f1 | sort

Задача 2 =======================================================================================

Ответ: cat /etc/protocols | grep -v '^#' | grep -v '^$' | awk '{print $2, $1}' | sort -nr | head -n 5

Задача 3 =======================================================================================

text="$1"
length=${#text}
 
line=$(printf '%*s' $((length + 2)) '' | tr ' ' '-')
 
echo "+${line}+"
echo "| ${text} |"
echo "+${line}+"

Задача 4 =======================================================================================

grep -o '[a-zA-Z_][a-zA-Z0-9]*' "$1" | sort -u | xargs

Задача 5 =======================================================================================

TARGET="$1"
 
chmod +x "$TARGET"
 
sudo cp "$TARGET" /usr/local/bin/

Задача 6 =======================================================================================

#!/bin/bash

for file in *.{c,js,py}; do

    [ -e "$file" ] || continue

    first_line=$(head -n 1 "$file")

    if echo "$first_line" | grep -qE '^(\/\/|\/\*|#)'; then
        echo "$file"
    fi
done

Задача 7 =======================================================================================

find . -type f -exec md5sum {} + | sort | uniq -w 32 -D

Задача 8 =======================================================================================

#!/bin/bash

dir=$1
ext=$2
archive=$3

find "$dir" -type f -name "*.$ext" -print0 | tar --null -cvf "$archive" --files-from=-

Задача 9 =======================================================================================

#!/bin/bash

input=$1
output=$2

sed 's/    /\t/g' "$input" > "$output"

Задача 10 =======================================================================================

#!/bin/bash

dir=$1

for file in "$dir"/*.txt; do
    if [ -f "$file" ] && [ ! -s "$file" ]; then
        echo "$file"
    fi
done
